# 1)მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even",
#  ხოლო თუ კენტია "odd"
# 2)ცვლადში შეინახეთ თქვენი სახელი, მომხმარებელს შემოატანინეთ მისი სახელი და თუ თქვენი სახელები ემთხვევა 
# დაუპრინტეთ "Hello" სხვა შემთხვევაში "Bye"
# 3)მომხმარებელს შემოატანინეთ რიცხვი და შეამოწმეთ, თუ რიცხვი მეტია 90-ზე, დაბეჭდეთ "A", თუ რიცხვი
#  ნაკლებია 90-ზე და მეტია 70-ზე, დაბეჭდეთ "B", თუ რიცხვი ნაკლებია 70-ზე და მეტია 50-ზე, დაბეჭდეთ "C", სხვა შემთხვევაში დაბეჭდეთ "D"
# 4)while ციკლის მეშვეობით, შექმენით რიცხვების დიაპაზონი 1-დან 100 ჩათვლით, შეამოწმეთ თუ რიცხვი არის ლუწი, 
# დაბეჭდეთ ეს რიცხვი while ციკლში და მიუწერეთ რომ ლუწია, თუ კენტია, დაბეჭდეთ ეს რიცხვი და გვერძე მიუწერეთ
#  რომ კენტია / მაგ: (1 კენტიტა, 2 ლუწია, 3 კენტია, 4 ლუწია...)




for i in range(1,101):
    if i % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")