# 1)შექმენით ცვლადი შეინახეთ მნიშვნელობად რაიმე სტრინგი
# შენი დავალებაა შეამოწმო,თუ ცვლადში შენახული სტრინგის პირველი ასო არის დიდი,
# მაგ შემთხვევაში დაუპრინტე ეს სიტყვა uppercase ში,სხვა შემთხვევაში კი დაუპრინტე ეს სიტყვა lowercase ში

# 2)მომხმარებელს შემოატანინე სახელი,თუ მომხმარებლის შემოტანილი სახელი შეიცავს ერთ uppercase ასოს მაინც
# (for loop გამოიყენეთ)მაშინ დაპრინტე ეს სახელი მთლიანად lowercase ში,სხვა შემთხვევაში დაპრინტე ეს სახელი
# რომელიც იქნება capitalize 

# 3)შექმენით სია სადაც მოათავსებული გექნებათ ცხვოველის სახელები,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი
# სახელებიდან რომელიმე სიგრძე ნაკლებია 5 ზე და თან ეს სიტყვა არის capitalized დააბრუნე ამ სიტყვიდან პირველი
#  3 ასო,
# სხვა შემთხვევაში დაუპრინტე რომ ეს სიტყვა გრძელია

# 4)შექმენი სია სადაც გექნება მოთავსებული lowercase სახელები,
# შენი დავალებაა გადაიყვანო და გამოპრინტო ყველა მათგანი uppercase ში

# 5)შექმენი სია სადაც გადაცემული გექნებათ სხვადასხვა მონაცემთა ტიპები,
# შენი დავალებაა შეამოწმო,თუ სიაში იმყოფება სტრინგ ტიპის მონაცემი,ეს სტრინგი უნდა გადააქციო uppercase 
# ად და უნდა დააბრუნოთ ამ სტრინგიდან ბოლო 3 ასო გამოიყენეთ მინუს ინდექსები

name = ["nika", "giorgi", "luka", "dato"]
lowercase = name.upper([0])
print(lowercase)