# 1) შექმენით სია, სადაც შეინახავთ საკვებ პროდუქტებს.
#  სიას მიანიჭეთ შესაბამისი სახელი და გამოიტანეთ იგი ტერმინალში.

# 2) შექმენით სია, რომლის მნიშვნელობებიც იქნება
#  კომპიუტერის აქსესუარები. სიიდან გამოიტანეთ იმ აქსესუარის ინდექსი, რომელსაც ყველაზე ხშირად იყენებთ.

# 3) შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ 
# მონაცემთა ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა
# ინდექსებზე. ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები.

# 4) მეოთხე დავალების მსგავსად, შექმენით ისეთი სია,თუმცა 
# ამჯერად შეინახეთ ყველა ნასწავლი მონაცემთა ტიპი თითოჯერ.
#  ბოლოს უარყოფითი ინდექსსებით გამოიტანეთ მხოლოდ String ტიპის მნიშვნელობა .
# დავალება1
food = ["შაქარი", "პური", "მარილი"]
print(food)
# დავალება3
arr = [2, 2, "nika", "gio", 5.5, 3.3, True, False]
integers = arr[0:2]
strings = arr[2:4]
float = arr[4:6]
bool = arr[6:8]
print("bool:",bool)
# დავალება4
arr = [2, "nika", 5.5, True]
integer = arr[0]
string = arr[1]
float = arr[2]
bool = arr[3]

print(string)