# ; 1)შექმენით სია რომელიც შედგება სახელებისგან, შემდეგ დაბეჭდეთ ტერმინალში ამ სიიდან მხოლოდ პირველი და
# ;  ბოლო ელემენტი
# ; 2)შექმენით სია რომელიც შედგება ხილის სახელებისგან, დაბეჭდეთ ბოლო 
# ; და ბოლოს წინა ელემენტი უარყოფითი ინდექსების საშუალებით
# ; 3)მომხმარებელს შემოატანინეთ მისი სახელი და შეინახეთ ცვლადში შემდეგ
# ;  გამოიტანეთ ამ სახელის პირველი და ბოლო ასო
# ; 4)შექმენით სია რომელიც შედგება ადამიანის სახელებისგან გამოიტანე სიის მე2 ელემენტიდან
# ;  მე5 ელემენტის ჩათვლით ყველა ელემენტი (გამოიყენეთ slicing)
# ; 5)შექმენით ტექნიკის მაღაზიის საიტი რომელზეც იქნება განთავსებული რამდენიმე კომპიუტერი/ლეპტოპი ან ტელეფონი.
# ; თითოეულ პროდუქტს უნდა ჰქონდეს სურათი დასახელება და ფასი. 
# ; სტილი თქვენ მიეცით სურვილისამებრ რაზეც გინდათ
# ; აუცილებლად გამოიყენეთ section და div თეგები

name = ["nika", "gio", "dato", "luka"]
print(name[0])
print(name[3])

fruit = ["sazamtro", "msxali", "vashli", "karalioki"]
print(fruit[-1])
print(fruit[-2])

name = input("enter your name")
print(name[0])
print(name[-1])

name = ["nika", "gio", "dato", "luka", "aleqsi"]
print(name[2:5])